In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("C://Users//khushi//Desktop//py//codebasicspy//ML//9_decision_tree//Exercise//titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
X = df.drop(["PassengerId","Survived", "Name", "SibSp", "Parch", "Ticket", "Cabin", "Embarked"], axis=1)
X.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [4]:
y = df.Survived
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [5]:
from sklearn.preprocessing import LabelEncoder

In [6]:
le_sex = LabelEncoder()

In [7]:
X["sex_n"] = le_sex.fit_transform(X["Sex"])
X.head()

   Pclass     Sex   Age     Fare  sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [8]:
X_features = X.drop(["Sex"], axis =1)
X_features.head()

   Pclass   Age     Fare  sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [14]:
X_features.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [19]:
X_features.Age = X_features.Age.fillna(X_features.Age.mean())
X_features.head(10)

   Pclass        Age     Fare  sex_n
0       3  22.000000   7.2500      1
1       1  38.000000  71.2833      0
2       3  26.000000   7.9250      0
3       1  35.000000  53.1000      0
4       3  35.000000   8.0500      1
5       3  29.699118   8.4583      1
6       1  54.000000  51.8625      1
7       3   2.000000  21.0750      1
8       3  27.000000  11.1333      0
9       2  14.000000  30.0708      0

In [20]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X_features, y, test_size=0.3, random_state=42)

In [21]:
from sklearn import tree

In [22]:
model = tree.DecisionTreeClassifier()

In [23]:
model.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [27]:
y_pred = model.predict(X_test)

In [29]:
from sklearn.metrics import mean_squared_error
mean_squared_error(y_test, y_pred)

0.24253731343283583

In [30]:
model.score(X_features, y)

0.9124579124579124